// let a = 5;

// if(true){
// 	let a = 6;
// 	console.log('a', a);
// }

// console.log('a', a);



//-----------------------------------------------------------

//CONSTANTS

// const a = 5;
// a = 10; - it will not change




//--------------------------------------------------------------

// Строки которые могут быть шаблонами

// let a = 2;
// let b = 3;
// console.log(`${a} + ${b} = ${a + b}`)


//--------------------------------------------------------------------
// fункции с дефолтными параметрами

// function showText(title = 'Default title', a = 200, b = 300){
// 	console.log(`${title} ${a} ${b}`);
// }

// showText();



// //--------------------------------------------------------------------
// // короткая запись функции

// let sum = (a,b) => a + b;
// console.log('sum(2,3)', sum(2,3));



//------------------------------------------------------------------
//Etarators

let arr = [1, 2, 3];
for (let value of arr) {
	console.log('value', value);
}



